// Дан многочлен 𝑃(𝑥) степени 𝑛. Получить многочлен 𝑃(𝑥) · 𝑃 ′(𝑥), где 𝑃′(𝑥) —это производная многочлена 𝑃(𝑥).
#include<iostream>

using namespace std;

int main() {
    setlocale(LC_ALL, "rus");
    int n, i, g, x, a[30][30], r[30], r2[30], z[30] = {0};
    cout << "n = ";
    cin >> n;
    n = n + 1;

    // заполняем массив 1
    for (i = 0; i < 30; i++) {
        a[0][i] = 1; 
        a[i][0] = 1;
    }
    // заполняем массив остальными эл-ми
    for (i = 1; i < n; i++)
        for (g = 1; g < n; g++)
            a[i][g] = a[i - 1][g] + a[i][g - 1];
    //вывод функции
    for (g = 0; g <= n - 1; g++)
    {
        cout << a[g][n - 1 - g] << ' ';
        r[g] = a[g][n - 1 - g];
    }
    cout << endl;
    //вывод производной
    for (g = 0; g <= n - 1; g++)
    {
        if (g != 0)
        {
            cout << g * a[g][n - 1 - g] << ' ';
            r2[g-1] = g * a[g][n - 1 - g];
        }
    }
    cout << endl;
    //перемножение многочленов
    for (i = 0; i <= n-1; i++)
        for (g = 0; g <= n-2; g++)
            z[i+g] += r[i] * r2[g];
    //вывод перемноженного
    for (i = 0;i <= 2*n - 3;i++) {
        cout << z[i] << ' ';
    }   
}
